#    IPSUR: Introduction to Probability and Statistics Using R
#    Copyright (C) 2014 G. Jay Kerns
#
#    This file is part of IPSUR.
#
#    IPSUR is free software: you can redistribute it and/or modify
#    it under the terms of the GNU General Public License as published by
#    the Free Software Foundation, either version 3 of the License, or
#    (at your option) any later version.
#
#    IPSUR is distributed in the hope that it will be useful,
#    but WITHOUT ANY WARRANTY; without even the implied warranty of
#    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
#    GNU General Public License for more details.
#
#    You should have received a copy of the GNU General Public License
#    along with IPSUR.  If not, see <http://www.gnu.org/licenses/>.

#+STARTUP:  beamer
#+TITLE:    STAT 3743: Probability and Statistics
#+AUTHOR:   G. Jay Kerns, Youngstown State University
#+EMAIL:    gkerns@ysu.edu
#+DATE:     Spring 2014
#+CREATOR:  Emacs 24.3.50.1 (Org mode 8.2.4)
#+OPTIONS:  H:2 texht:t toc:nil
#+PROPERTY: session *R*
#+PROPERTY: exports results
#+PROPERTY: results output
#+PROPERTY: eval no-export
#+PROPERTY: tangle yes
#+BEAMER_THEME: 
#+BEAMER_FRAME_LEVEL: 2
#+EPRESENT_FRAME_LEVEL: 2
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [bigger]
#+LaTeX_HEADER: \newcommand{\E}{\mathrm{I\! E}}
#+LaTeX_HEADER: %\usepackage{handoutWithNotes}
#+LaTeX_HEADER: %\pgfpagesuselayout{2 on 1 with notes landscape}[letterpaper,border shrink=5mm]
#+LaTeX_HEADER: \usepackage{pgfpages}
#+LaTeX_HEADER: \pgfpagesuselayout{4 on 1}[letterpaper,border shrink=5mm,landscape]
#+SELECT_TAGS: prob

*** How to do it with R						    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:

#+BEGIN_SRC R :exports both
A <- xtabs(Freq ~ Survived + Class, data = Titanic)
addmargins(A)
#+END_SRC

#+RESULTS:
:         Class
: Survived  1st  2nd  3rd Crew  Sum
:      No   122  167  528  673 1490
:      Yes  203  118  178  212  711
:      Sum  325  285  706  885 2201

** Bivariate data: more on tables

#+LaTeX: \begin{small}
#+BEGIN_SRC R :exports both
library(abind)
colPercents(A)
rowPercents(A)
#+END_SRC

#+RESULTS:
#+begin_example
        Class
Survived   1st   2nd   3rd Crew
   No     37.5  58.6  74.8   76
   Yes    62.5  41.4  25.2   24
   Total 100.0 100.0 100.0  100
   Count 325.0 285.0 706.0  885
        Class
Survived  1st  2nd  3rd Crew Total Count
     No   8.2 11.2 35.4 45.2   100  1490
     Yes 28.6 16.6 25.0 29.8   100   711
#+end_example

#+LaTeX: \end{small}

